In [1]:
#PANDAS BASICS REVISION

In [3]:
import pandas as pd
import numpy as np

In [4]:
df = pd.DataFrame(np.arange(0,10).reshape(2,5),index = ['row1','row2'],columns = ['column1','column2','column3','column4','column5'])

In [5]:
df

      column1  column2  column3  column4  column5
row1        0        1        2        3        4
row2        5        6        7        8        9

In [6]:
#accessing the elements in the dataframe using loc and iloc

In [7]:
df.loc['row1']

column1    0
column2    1
column3    2
column4    3
column5    4
Name: row1, dtype: int32

In [8]:
df.iloc[:,2:4]

      column3  column4
row1        2        3
row2        7        8

In [9]:
type(df.loc['row1'])

pandas.core.series.Series

In [10]:
#Conversion into array

df.iloc[:,2:4].values

array([[2, 3],
       [7, 8]])

In [11]:
df.column2.value_counts()

6    1
1    1
Name: column2, dtype: int64

In [12]:
#to check null values present in the data set

df.isnull().sum()

column1    0
column2    0
column3    0
column4    0
column5    0
dtype: int64

In [13]:
df.column1.unique

<bound method Series.unique of row1    0
row2    5
Name: column1, dtype: int32>

In [14]:


df1 = pd.DataFrame(np.random.rand(1,20).reshape(5,4),index='a b c d e'.split(),columns = 'w x y z'.split())

In [15]:
df1

          w         x         y         z
a  0.685727  0.646894  0.069062  0.244802
b  0.353646  0.147930  0.864624  0.614109
c  0.499904  0.735149  0.465940  0.867184
d  0.137549  0.319177  0.590001  0.226818
e  0.584760  0.291047  0.689532  0.349424

In [16]:
df1.loc[['a','b'],['x','y']]

          x         y
a  0.646894  0.069062
b  0.147930  0.864624

In [17]:
df1.iloc[2:3,1:2]

          x
c  0.735149

In [18]:
#to display only the values greater than a particular number

In [19]:
df1[df1['w']>0.6]

          w         x         y         z
a  0.685727  0.646894  0.069062  0.244802

In [20]:
#we can specify the datatype while reading data  dtype ={'a'.int}
#we can change the index index_col =1

In [21]:
#handling na values

In [22]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[3,np.nan,np.nan],
                  'C':[1,2,3]})

In [23]:
df

     A    B  C
0  1.0  3.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [24]:
import pandas as pd

In [35]:
df.dropna(thresh =1)

     A    B  C
0  1.0  3.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [38]:
df.dropna(how = 'all')

     A    B  C
0  1.0  3.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [39]:
df.fillna(value = 'some numbers')

              A             B  C
0             1             3  1
1             2  some numbers  2
2  some numbers  some numbers  3

In [41]:
df['A'].fillna(value = df['A'].mean(),inplace=True)